import '../CSS/Selfintro.css';

const SelfIntro = () => {
  return (
    <div id ="selfIntro">
      <div class ="division">
        <h3>자소서 쓰는법</h3>
        <ul>
          <li> 자기소개서에서 필수적으로 묻는 항목이 있습니다.</li>
          <li> 어떻게 살아왔는지 어떤 가치관을 가지고 자라왔는지를 작성 </li>
          <li> '성장과정'과 자신의 성격에 대한 평가('성격 장단점') </li>
          <li> 성격을 유추해 볼 수 있는 '취미와 특기'</li> 
          <li> '입사지원동기' 및 '입사 후 포부 및 장래계획'</li>
        </ul>
      </div>

      <div class ="division">
        <h3>성장과정은 본인의 특별한 점을 부각</h3>
        <p>
        저는 충청남도 천안에서 태어났으며, 가족 구성원으로는 엄마, 아빠, 첫째 누나, 둘째 누나, 
        그리고 제가 함께 살고 있습니다. 저의 어린 시절은 따뜻하고 지지해 주시는 가족과 함께 평온하게 보낼 수 있었습니다. 
        가정 환경이 안정적이었기 때문에 안심하고 자랄 수 있었고, 가족과의 관계는 항상 원만하였습니다. 
        이러한 배경 덕분에 자신감을 가지고 성장할 수 있었고, 가족에 대한 감사함을 느끼고 있습니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>둘째로, '취미와 특기' 입니다. </h3>
        <p>
        저는 어렸을 때부터 음악에 큰 관심을 가지고 있었으며, 밴드 활동을 즐겨하고 있습니다.
        또한, 드럼과 기타를 연주하는 것은 제 취미 중 하나입니다. 이를 통해 음악을 통해 감정을 표현하고, 
        창의적으로 자아를 발전시킬 수 있는 기회를 찾았습니다. 또한, 음악을 통해 협업과 소통의 중요성을 배우게 되었습니다.
        고등학교 때부터 컴퓨터 공학에 대한 관심을 가지게 되었고, 이 분야에서 관련 활동을 적극적으로 참여하며 스스로 발전해 나갔습니다. 
        이러한 경험을 토대로 대학에 진학한 후, 컴퓨터 공학을 전공하고 있습니다. 미래에는 데이터 과학 분야로 나아가고 싶어하는 목표를 가지고 있습니다. 
        데이터와 기술의 힘을 활용하여 사회적 문제를 해결하고 혁신적인 솔루션을 찾는 것이 제 꿈입니다.
        </p>
      </div>
      
      <div class ="division">
        <h3>'입사지원동기' 쓰는 법입니다. </h3>
        <p>
        입사 지원 동기
저는 항상 기술과 혁신에 열정을 품고 있으며, 이를 통해 사회에 긍정적인 영향을 주고 싶어합니다. 따라서 이 기업에 지원하게 된 동기는 크게 세 가지로 요약할 수 있습니다.

1. 기업의 혁신과 역량

이 기업은 항상 기술 혁신과 창의적인 솔루션을 추구하며, 그 결과 글로벌 시장에서 우수한 평판을 얻고 있습니다. 특히, 회사가 가진 데이터 과학과 기술 분야의 역량은 제가 가장 큰 관심을 가지고 있는 분야와 부합합니다. 여기에서 일한다면 끊임없이 배우고 성장하며 혁신적인 아이디어를 추구할 수 있다고 믿습니다.

2. 문제 해결과 사회적 영향

이 회사는 기술을 통해 사회적 문제를 해결하고 있으며, 그 노력이 사회에 긍정적인 영향을 끼치고 있습니다. 나아가, 회사의 사회적 책임감과 지속 가능한 경영 미션은 저의 가치관과 일치합니다. 이를 통해 일하면서 진정한 의미 있는 일을 수행하고 싶다고 생각합니다.

3. 직무와 업무 환경

저는 데이터 과학 분야에 대한 열정을 가지고 있으며, 해당 분야에서 꾸준한 경험을 쌓아왔습니다. 이 기업에서는 데이터 과학자로서 업무를 수행하고, 새로운 도전과 프로젝트에 참여할 기회를 제공하고 있다는 것이 매력적입니다. 또한, 회사는 열린 업무 환경과 협력적인 문화를 가지고 있어, 제 역량을 펼칠 수 있는 환경이라고 생각합니다.

이러한 이유로, 이 기업에서 일하고 성장하며, 기술과 혁신을 통해 사회적 문제에 도전하고 해결하고자 합니다. 제 역량과 열정을 바탕으로 이 기업에 기여하고, 함께 성장하고자 하는 의지를 갖고 있습니다.
        </p>
      </div>

      <div class ="division">
        <h3>포부 및 장래계획 쓰는법입니다. </h3>
        <p>
        저의 포부는 기술과 혁신을 통해 사회에 긍정적인 영향을 미치는 것입니다. 이를 위해 다음과 같은 목표와 비전을 품고 있습니다:

1. 기술의 발전을 주도

기술은 우리의 삶을 변화시키고, 문제를 해결하는 열쇠입니다. 제 목표는 기술의 발전을 주도하여 사회적 문제를 해결하고 혁신적인 솔루션을 찾는 것입니다. 이를 통해 더 나은 세상을 만들고자 합니다.

2. 지속 가능성과 사회적 책임

환경 문제와 사회적 문제에 대한 심각한 고민을 하며, 기업이나 조직의 사회적 책임을 강조하는 방향으로 업무를 수행하고 싶습니다. 지속 가능한 방식으로 기술을 개발하고, 사회적 영향을 고려하는 미션을 추구하고자 합니다.
        </p>  
      </div>
  
      <div class ="division">
        <h3>절대 지켜야할 것들 - 글자수, 오탈자</h3>
        <p>
          오탈자에 대한 검토는 여러번 하세요. 
          자소서 무료첨삭을 하다가 보면, 
          줄간격도 맞추지 않고 심지어 오탈자가 한페이지에 4,5개씩 나오는 분들이 계십니다. 
          맞춤법을 틀리는 것은 본인의 지식수준을 나타낸다고 한다면, 
          오자가 많은 자소서를 그대로 제출한다는 것은 지원 자체의 간절함이 없고 
          성의가 없는 지원자임을 나타내는 것입니다. 
          오탈자 검토를 하지도 않고 제출하는 것보다는 
          차라리 제출하지 않는 것이 낫다고 봅니다. 
  
          글자수에 대한 기준은 반드시 지키세요. 
          요즘은 인터넷으로 일정 글자수가 넘어가면 더 이상 입력이 되지 않는 경우가 많습니다. 
          그렇다고 1,500자 기준에 500자 정도만 작성하는 등 회사가 정해놓은 글자수에 지나치게 
          모자르거나, 지나치게 많은 것은 절대 좋지 않습니다. 
          자소서를 입력할 때 글자수 표시가 되지 않는다면, 
          맞춤법검사기와 띄어쓰기검사기, 그리고 글자수세기는 반드시 하고 제출하세요.
        </p>  
      </div>
    </div>
  );
};

export default SelfIntro;